99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs.c
#include "esp32_mquickjs_core.h"
#include "utils/esp32_mquickjs_byte_source.h"
#include "esp32_mquickjs_sys.h"
#include "esp32_mquickjs_adc.h"
#include "esp32_mquickjs_dac.h"
#include "esp32_mquickjs_fs.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_event_queue.h"
#include "esp32_mquickjs_memory.h"
#include "esp32_mquickjs_gpio.h"
#include "esp32_mquickjs_http.h"
#include "esp32_mquickjs_http_server.h"
#include "esp32_mquickjs_i2c.h"
#include "esp32_mquickjs_i2s.h"
#include "esp32_mquickjs_rmt.h"
#include "esp32_mquickjs_espnow.h"
#include "esp32_mquickjs_wifi_csi.h"
#include "esp32_mquickjs_ble.h"
#include "esp32_mquickjs_camera.h"
#include "esp32_mquickjs_bitmap.h"
#include "esp32_mquickjs_ledc.h"
#include "esp32_mquickjs_log_ring.h"
#include "esp32_mquickjs_nvs.h"
#include "esp32_mquickjs_net.h"
#include "esp32_mquickjs_peripheral_lease.h"
#include "esp32_mquickjs_reaper.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_RPC
#include "esp32_mquickjs_rpc.h"
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS
#include "esp32_mquickjs_runtime_logs.h"
#endif
#include "esp32_mquickjs_spi.h"
#include "esp32_mquickjs_stream.h"
#include "esp32_mquickjs_time.h"
#include "esp32_mquickjs_socket.h"
#include "esp32_mquickjs_uart.h"
#include "esp32_mquickjs_usb_serial.h"
#include "esp32_mquickjs_websocket.h"
#include "esp32_mquickjs_wifi.h"
#include "js_stdlib.h"

#include <inttypes.h>
#include <stdbool.h>
#include <stdatomic.h>
#include <stdio.h>
#include <string.h>
#include <sys/time.h>

#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_random.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"

static esp32_mquickjs_runtime_t *s_active_runtime;

static void esp32_mquickjs_ensure_boot_id(esp32_mquickjs_runtime_t *runtime)
{
    static const char hex[] = "0123456789abcdef";
    uint8_t bytes[ESP32_MQUICKJS_BOOT_ID_LENGTH / 2U];
    size_t i;

    if (runtime == NULL || runtime->boot_id[0] != '\0') {
        return;
    }
    esp_fill_random(bytes, sizeof(bytes));
    for (i = 0; i < sizeof(bytes); ++i) {
        runtime->boot_id[i * 2U] = hex[bytes[i] >> 4U];
        runtime->boot_id[(i * 2U) + 1U] = hex[bytes[i] & 0x0fU];
    }
    runtime->boot_id[ESP32_MQUICKJS_BOOT_ID_LENGTH] = '\0';
}

typedef struct esp32_mquickjs_timer_slot esp32_mquickjs_timer_slot_t;

typedef struct {
    uint8_t timer_id;
    uint32_t generation;
} esp32_mquickjs_timer_event_t;

typedef struct {
    QueueHandle_t queue;
    esp32_mquickjs_timer_slot_t *slots;
} esp32_mquickjs_timer_state_t;

typedef struct {
    esp32_mquickjs_async_poller_t poller;
    void *opaque;
} esp32_mquickjs_async_poller_entry_t;

#define ESP32_MQUICKJS_IDLE_JOB_CAPACITY 8

typedef struct {
    JSGCRef callback;
    bool allocated;
} esp32_mquickjs_idle_job_t;

typedef struct {
    void *task_handle;
    size_t poller_count;
    esp32_mquickjs_async_poller_entry_t *pollers;
    esp32_mquickjs_reaper_registry_t reapers;
    esp32_mquickjs_idle_job_t idle_jobs[ESP32_MQUICKJS_IDLE_JOB_CAPACITY];
    uint8_t idle_head;
    uint8_t idle_tail;
    uint8_t idle_count;
    uint32_t execution_depth;
} esp32_mquickjs_async_state_t;

static esp32_mquickjs_timer_state_t *esp32_mquickjs_timer_state(
    esp32_mquickjs_runtime_t *runtime);

struct esp32_mquickjs_timer_slot {
    esp32_mquickjs_runtime_t *runtime;
    esp_timer_handle_t handle;
    JSGCRef callback;
    uint32_t generation;
    uint8_t timer_id;
    bool allocated;
    bool repeating;
    bool pending;
    _Atomic bool delivery_lost;
};

#define ESP32_MQUICKJS_MAX_ASYNC_POLLERS 8
#define ESP32_MQUICKJS_TIMER_HANDLE_ID_BITS 6U
#define ESP32_MQUICKJS_TIMER_HANDLE_ID_MASK ((1U << ESP32_MQUICKJS_TIMER_HANDLE_ID_BITS) - 1U)
#define ESP32_MQUICKJS_TIMER_HANDLE_MAX \
    (((uint64_t)UINT32_MAX << ESP32_MQUICKJS_TIMER_HANDLE_ID_BITS) | \
     ESP32_MQUICKJS_TIMER_HANDLE_ID_MASK)

static void note_console_output(void)
{
    if (s_active_runtime != NULL) {
        s_active_runtime->output_generation++;
    }
}

static esp32_mquickjs_async_state_t *esp32_mquickjs_async_state(esp32_mquickjs_runtime_t *runtime)
{
    if (runtime == NULL) {
        return NULL;
    }
    return runtime->async_state;
}

static void esp32_mquickjs_execution_enter(esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(runtime);

    if (state != NULL) {
        state->execution_depth++;
    }
}

static void esp32_mquickjs_execution_leave(esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(runtime);

    if (state != NULL && state->execution_depth > 0) {
        state->execution_depth--;
    }
}

static bool esp32_mquickjs_execution_active(
    esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(runtime);

    return state != NULL && state->execution_depth != 0;
}

static JSValue esp32_mquickjs_finish_execution(
    esp32_mquickjs_runtime_t *runtime,
    JSValue result)
{
    esp32_mquickjs_execution_leave(runtime);
    return result;
}

static void esp32_mquickjs_clear_idle_jobs(JSContext *ctx,
                                           esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(runtime);

    if (state == NULL) {
        return;
    }
    while (state->idle_count > 0) {
        esp32_mquickjs_idle_job_t *job = &state->idle_jobs[state->idle_head];

        if (job->allocated && ctx != NULL) {
            JS_DeleteGCRef(ctx, &job->callback);
        }
        job->allocated = false;
        state->idle_head = (uint8_t)(
            (state->idle_head + 1U) % ESP32_MQUICKJS_IDLE_JOB_CAPACITY);
        state->idle_count--;
    }
    state->idle_head = 0;
    state->idle_tail = 0;
}

static bool esp32_mquickjs_poll_idle_job(JSContext *ctx,
                                         esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(runtime);
    esp32_mquickjs_idle_job_t *job;
    JSGCRef callback_ref;
    JSValue *callback;
    JSValue result;

    if (ctx == NULL || state == NULL || state->execution_depth != 0 ||
        state->idle_count == 0) {
        return false;
    }

    job = &state->idle_jobs[state->idle_head];
    if (!job->allocated) {
        state->idle_head = (uint8_t)(
            (state->idle_head + 1U) % ESP32_MQUICKJS_IDLE_JOB_CAPACITY);
        state->idle_count--;
        return true;
    }

    callback = JS_PushGCRef(ctx, &callback_ref);
    *callback = job->callback.val;
    JS_DeleteGCRef(ctx, &job->callback);
    job->allocated = false;
    state->idle_head = (uint8_t)(
        (state->idle_head + 1U) % ESP32_MQUICKJS_IDLE_JOB_CAPACITY);
    state->idle_count--;

    result = esp32_mquickjs_call(ctx, runtime, *callback, JS_NULL, 0, NULL);
    if (JS_IsException(result)) {
        esp32_mquickjs_print_exception(ctx);
    }
    JS_PopGCRef(ctx, &callback_ref);
    return true;
}

static bool esp32_mquickjs_init_async_state(esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_async_state_t *state;

    if (runtime == NULL) {
        return false;
    }
    if (runtime->async_state != NULL) {
        return true;
    }

    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        return false;
    }

