99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs.c
    state->pollers = heap_caps_calloc(ESP32_MQUICKJS_MAX_ASYNC_POLLERS,
                                      sizeof(*state->pollers),
                                      MALLOC_CAP_8BIT);
    if (state->pollers == NULL) {
        heap_caps_free(state);
        return false;
    }
    esp32_mquickjs_reaper_init(&state->reapers);

    runtime->async_state = state;
    return true;
}

bool esp32_mquickjs_register_reaper(esp32_mquickjs_runtime_t *runtime,
                                    esp32_mquickjs_reap_fn reap,
                                    void *opaque)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(runtime);

    if (state == NULL || reap == NULL ||
        !esp32_mquickjs_reaper_register(
            &state->reapers, (esp32_mquickjs_reaper_fn_t)reap, opaque)) {
        return false;
    }
    esp32_mquickjs_notify_activity(runtime);
    return true;
}

bool esp32_mquickjs_register_reserved_reaper(
    esp32_mquickjs_runtime_t *runtime,
    size_t reserved_slot,
    esp32_mquickjs_reap_fn reap,
    void *opaque)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(runtime);

    if (state == NULL || reap == NULL ||
        !esp32_mquickjs_reaper_register_reserved(
            &state->reapers, reserved_slot,
            (esp32_mquickjs_reaper_fn_t)reap, opaque)) {
        return false;
    }
    esp32_mquickjs_notify_activity(runtime);
    return true;
}

bool esp32_mquickjs_unregister_reaper(esp32_mquickjs_runtime_t *runtime,
                                      esp32_mquickjs_reap_fn reap,
                                      void *opaque)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(runtime);

    return state != NULL && reap != NULL &&
           esp32_mquickjs_reaper_unregister(
               &state->reapers, (esp32_mquickjs_reaper_fn_t)reap, opaque);
}

bool esp32_mquickjs_register_async_poller(esp32_mquickjs_runtime_t *runtime,
                                          esp32_mquickjs_async_poller_t poller,
                                          void *opaque)
{
    esp32_mquickjs_async_state_t *state;
    size_t i;

    if (runtime == NULL || poller == NULL) {
        return false;
    }
    if (!esp32_mquickjs_init_async_state(runtime)) {
        return false;
    }

    state = esp32_mquickjs_async_state(runtime);
    if (state == NULL || state->pollers == NULL) {
        return false;
    }

    for (i = 0; i < state->poller_count; ++i) {
        if (state->pollers[i].poller == poller && state->pollers[i].opaque == opaque) {
            return true;
        }
    }
    if (state->poller_count >= ESP32_MQUICKJS_MAX_ASYNC_POLLERS) {
        return false;
    }

    state->pollers[state->poller_count].poller = poller;
    state->pollers[state->poller_count].opaque = opaque;
    state->poller_count++;
    return true;
}

void esp32_mquickjs_attach_current_task(esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_async_state_t *state;

    if (runtime == NULL || !esp32_mquickjs_init_async_state(runtime)) {
        return;
    }

    state = esp32_mquickjs_async_state(runtime);
    if (state != NULL) {
        state->task_handle = xTaskGetCurrentTaskHandle();
    }
}

void esp32_mquickjs_detach_current_task(esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(runtime);

    if (state != NULL) {
        state->task_handle = NULL;
    }
}

void esp32_mquickjs_notify_activity(esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(runtime);

    if (state != NULL && state->task_handle != NULL) {
        xTaskNotifyGive(state->task_handle);
    }
}

void esp32_mquickjs_notify_active_runtime_from_isr(int *task_woken)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(s_active_runtime);

    if (state != NULL && state->task_handle != NULL) {
        vTaskNotifyGiveFromISR(state->task_handle, (BaseType_t *)task_woken);
    }
}

void esp32_mquickjs_set_cooperate_hook(esp32_mquickjs_runtime_t *runtime,
                                       esp32_mquickjs_cooperate_fn cooperate,
                                       void *opaque)
{
    if (runtime == NULL) {
        return;
    }
    runtime->cooperate = cooperate;
    runtime->cooperate_opaque = opaque;
}

bool esp32_mquickjs_cooperate(esp32_mquickjs_runtime_t *runtime)
{
    if (runtime == NULL) {
        return true;
    }
    if (runtime->scoped_deadline_us > 0 &&
        (uint64_t)esp_timer_get_time() >= runtime->scoped_deadline_us) {
        return false;
    }
    return runtime->cooperate == NULL || runtime->cooperate(runtime->cooperate_opaque);
}

void esp32_mquickjs_native_wait_begin(esp32_mquickjs_runtime_t *runtime,
                                      esp32_mquickjs_native_wait_t *wait)
{
    if (wait == NULL) {
        return;
    }
    wait->saved_deadline_us = runtime != NULL ? runtime->deadline_us : 0;
    wait->started_us = (uint64_t)esp_timer_get_time();
    wait->active = runtime != NULL;
    if (runtime != NULL) {
        runtime->deadline_us = 0;
        if (runtime->native_wait_depth < UINT16_MAX) {
            runtime->native_wait_depth++;
        }
    }
}

void esp32_mquickjs_native_wait_end(esp32_mquickjs_runtime_t *runtime,
                                    esp32_mquickjs_native_wait_t *wait)
{
    uint64_t elapsed_us;

    if (runtime == NULL || wait == NULL || !wait->active) {
        return;
    }
    wait->active = false;
    if (runtime->native_wait_depth > 0) {
        runtime->native_wait_depth--;
    }
    elapsed_us = (uint64_t)esp_timer_get_time() - wait->started_us;
    if (wait->saved_deadline_us == 0) {
        runtime->deadline_us = 0;
    } else if (wait->saved_deadline_us > UINT64_MAX - elapsed_us) {
        runtime->deadline_us = UINT64_MAX;
    } else {
        runtime->deadline_us = wait->saved_deadline_us + elapsed_us;
    }
    wait->saved_deadline_us = 0;
    wait->started_us = 0;
}

static uint32_t esp32_mquickjs_bound_wait_slice(
    const esp32_mquickjs_runtime_t *runtime,
    uint32_t slice_ms)
{
    uint64_t now_us;
    uint64_t remaining_us;
    uint32_t remaining_ms;

    if (runtime == NULL || runtime->scoped_deadline_us == 0) {
        return slice_ms;
    }
    now_us = (uint64_t)esp_timer_get_time();
    if (now_us >= runtime->scoped_deadline_us) {
        return 0;
    }
    remaining_us = runtime->scoped_deadline_us - now_us;
    remaining_ms = (uint32_t)((remaining_us + 999ULL) / 1000ULL);
    return remaining_ms < slice_ms ? remaining_ms : slice_ms;
}

bool esp32_mquickjs_cooperative_delay(esp32_mquickjs_runtime_t *runtime,
                                      uint32_t delay_ms)
{
    esp32_mquickjs_native_wait_t wait;
    uint32_t remaining_ms = delay_ms;
    bool completed = true;

    esp32_mquickjs_native_wait_begin(runtime, &wait);
    do {
        uint32_t slice_ms;
        TickType_t wait_ticks;

        if (!esp32_mquickjs_cooperate(runtime)) {
            completed = false;
            break;
        }
        (void)esp32_mquickjs_future_cooperate(runtime);
        if (remaining_ms == 0) {
            break;
        }
        slice_ms = remaining_ms > ESP32_MQUICKJS_COOPERATIVE_WAIT_SLICE_MS
                       ? ESP32_MQUICKJS_COOPERATIVE_WAIT_SLICE_MS
                       : remaining_ms;
        slice_ms = esp32_mquickjs_bound_wait_slice(runtime, slice_ms);
        if (slice_ms == 0) {
            completed = false;
            break;
        }
        wait_ticks = pdMS_TO_TICKS(slice_ms);
        if (wait_ticks == 0) {
            wait_ticks = 1;
        }
        vTaskDelay(wait_ticks);
        remaining_ms -= slice_ms;
    } while (remaining_ms > 0);

    if (completed && !esp32_mquickjs_cooperate(runtime)) {
        completed = false;
    }
    esp32_mquickjs_native_wait_end(runtime, &wait);
    return completed;
}

