99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs.c
bool esp32_mquickjs_wait_for_activity(esp32_mquickjs_runtime_t *runtime,
                                      uint32_t timeout_ms)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(runtime);
    uint32_t remaining_ms;

    timeout_ms = esp32_mquickjs_future_next_wait_ms(runtime, timeout_ms);
    if (state != NULL && esp32_mquickjs_reaper_pending(&state->reapers) > 0 &&
        (timeout_ms == UINT32_MAX ||
         timeout_ms > ESP32_MQUICKJS_REAPER_RETRY_MS)) {
        timeout_ms = ESP32_MQUICKJS_REAPER_RETRY_MS;
    }
    remaining_ms = timeout_ms;

    for (;;) {
        uint32_t slice_ms;
        TickType_t wait_ticks;
        bool notified;

        if (!esp32_mquickjs_cooperate(runtime)) {
            return false;
        }
        if (timeout_ms == UINT32_MAX) {
            slice_ms = ESP32_MQUICKJS_COOPERATIVE_WAIT_SLICE_MS;
        } else {
            slice_ms = remaining_ms > ESP32_MQUICKJS_COOPERATIVE_WAIT_SLICE_MS
                           ? ESP32_MQUICKJS_COOPERATIVE_WAIT_SLICE_MS
                           : remaining_ms;
        }
        slice_ms = esp32_mquickjs_bound_wait_slice(runtime, slice_ms);
        if (slice_ms == 0) {
            return false;
        }
        wait_ticks = pdMS_TO_TICKS(slice_ms);
        if (slice_ms > 0 && wait_ticks == 0) {
            wait_ticks = 1;
        }

        if (state == NULL || state->task_handle == NULL) {
            if (wait_ticks > 0) {
                vTaskDelay(wait_ticks);
            }
            notified = false;
        } else {
            notified = ulTaskNotifyTake(pdTRUE, wait_ticks) > 0;
        }
        if (!esp32_mquickjs_cooperate(runtime)) {
            return false;
        }
        if (notified) {
            return true;
        }
        if (timeout_ms == UINT32_MAX) {
            continue;
        }
        if (remaining_ms <= slice_ms) {
            return false;
        }
        remaining_ms -= slice_ms;
    }
}

static bool esp32_mquickjs_poll_registered(JSContext *ctx,
                                           esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(runtime);
    bool handled = false;
    size_t i;

    if (state == NULL || state->pollers == NULL) {
        return false;
    }

    for (i = 0; i < state->poller_count; ++i) {
        if (state->pollers[i].poller != NULL &&
            state->pollers[i].poller(ctx, runtime, state->pollers[i].opaque)) {
            handled = true;
        }
    }
    return handled;
}

static bool esp32_mquickjs_poll_reapers(esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(runtime);

    if (state == NULL) {
        return false;
    }
    return esp32_mquickjs_reaper_poll(&state->reapers,
                                      ESP32_MQUICKJS_REAPER_BATCH_LIMIT,
                                      NULL) > 0;
}

static size_t esp32_mquickjs_reapers_pending(
    esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(runtime);

    return state == NULL ? 0 :
           esp32_mquickjs_reaper_pending(&state->reapers);
}

static void prepare_console_output(void)
{
    if (s_active_runtime != NULL && s_active_runtime->prepare_output != NULL) {
        s_active_runtime->prepare_output(s_active_runtime->prepare_output_opaque);
    }
}

static void console_output_begin(esp32_mquickjs_runtime_t *runtime,
                                 esp32_mquickjs_log_source_t source)
{
    prepare_console_output();
#if CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS
    esp32_mquickjs_runtime_logs_console_begin(runtime, source);
#else
    (void)runtime;
    (void)source;
#endif
}

static void console_output_write(esp32_mquickjs_runtime_t *runtime,
                                 const void *buf,
                                 size_t buf_len)
{
#if CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS
    esp32_mquickjs_runtime_logs_console_write(runtime, buf, buf_len);
#else
    (void)runtime;
    fwrite(buf, 1, buf_len, stdout);
#endif
}

static void console_output_end(esp32_mquickjs_runtime_t *runtime)
{
#if CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS
    esp32_mquickjs_runtime_logs_console_end(runtime);
#else
    (void)runtime;
    fputc('\n', stdout);
    fflush(stdout);
#endif
    note_console_output();
}

static void js_log_write(void *opaque, const void *buf, size_t buf_len)
{
    console_output_write(opaque, buf, buf_len);
}

static int js_interrupt_handler(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_runtime_t *runtime = opaque;

    (void)ctx;
    if (runtime == NULL) {
        return 0;
    }
    if (!esp32_mquickjs_cooperate(runtime)) {
        return 1;
    }
    return runtime->deadline_us != 0 && esp_timer_get_time() > runtime->deadline_us;
}

JSValue esp32_mquickjs_call(JSContext *ctx,
                            esp32_mquickjs_runtime_t *runtime,
                            JSValue function,
                            JSValue this_value,
                            int argc,
                            JSValue *argv)
{
    uint64_t previous_deadline = runtime != NULL ? runtime->deadline_us : 0;
    JSGCRef function_ref;
    JSGCRef this_ref;
    JSGCRef *argument_refs = NULL;
    JSValue *rooted_function;
    JSValue *rooted_this;
    JSValue result = JS_EXCEPTION;
    int i;

    if (ctx == NULL || argc < 0 || (argc > 0 && argv == NULL)) {
        return JS_EXCEPTION;
    }
    if (argc > 0) {
        argument_refs = heap_caps_calloc((size_t)argc,
                                         sizeof(*argument_refs),
                                         MALLOC_CAP_8BIT);
        if (argument_refs == NULL) {
            return JS_ThrowOutOfMemory(ctx);
        }
    }

    rooted_function = JS_PushGCRef(ctx, &function_ref);
    rooted_this = JS_PushGCRef(ctx, &this_ref);
    *rooted_function = function;
    *rooted_this = this_value;
    for (i = 0; i < argc; ++i) {
        JSValue *rooted_argument = JS_PushGCRef(ctx, &argument_refs[i]);

        *rooted_argument = argv[i];
    }

    if (JS_StackCheck(ctx, (uint32_t)(argc + 2))) {
        goto done;
    }
    if (runtime != NULL && runtime->eval_timeout_ms > 0) {
        uint64_t call_deadline = esp_timer_get_time() +
                                 ((uint64_t)runtime->eval_timeout_ms * 1000ULL);

        if (previous_deadline == 0 || call_deadline < previous_deadline) {
            runtime->deadline_us = call_deadline;
        }
    }

    for (i = argc - 1; i >= 0; --i) {
        JS_PushArg(ctx, argument_refs[i].val);
    }
    JS_PushArg(ctx, *rooted_function);
    JS_PushArg(ctx, *rooted_this);
    esp32_mquickjs_execution_enter(runtime);
    result = JS_Call(ctx, argc);
    result = esp32_mquickjs_finish_execution(runtime, result);

    if (runtime != NULL) {
        runtime->deadline_us = previous_deadline;
    }

done:
    for (i = argc - 1; i >= 0; --i) {
        JS_PopGCRef(ctx, &argument_refs[i]);
    }
    JS_PopGCRef(ctx, &this_ref);
    JS_PopGCRef(ctx, &function_ref);
    heap_caps_free(argument_refs);
    return result;
}

bool esp32_mquickjs_set_property(JSContext *ctx,
                                 JSValue target_obj,
                                 const char *name,
                                 JSValue value)
{
    return !JS_IsException(target_obj) && !JS_IsException(value) &&
           !JS_IsException(JS_SetPropertyStr(ctx, target_obj, name, value));
}

bool esp32_mquickjs_set_property_ref(JSContext *ctx,
                                     JSValue *target_obj,
                                     const char *name,
                                     JSValue value)
{
    return target_obj != NULL && !JS_IsException(*target_obj) &&
           !JS_IsException(value) &&
           !JS_IsException(JS_SetPropertyStr(ctx, *target_obj, name, value));
}

JSValue esp32_mquickjs_throw_native_error(JSContext *ctx,
                                          const char *code,
                                          const char *operation,
                                          const char *message,
                                          JSValue details)
{
    JSGCRef details_ref;
    JSGCRef error_ref;
    JSValue *rooted_details = JS_PushGCRef(ctx, &details_ref);
    JSValue *error;

    *rooted_details = details;
    (void)JS_ThrowInternalError(ctx, "%s: %s",
                                code != NULL ? code : "NATIVE_ERROR",
                                message != NULL ? message
                                                : "native operation failed");
    if (!JS_HasException(ctx)) {
        JS_PopGCRef(ctx, &details_ref);
        return JS_EXCEPTION;
    }
    error = JS_PushGCRef(ctx, &error_ref);
    *error = JS_GetException(ctx);
    if (JS_GetClassID(ctx, *error) < 0 ||
        !esp32_mquickjs_set_property_ref(
            ctx, error, "code",
            JS_NewString(ctx, code != NULL ? code : "NATIVE_ERROR")) ||
        !esp32_mquickjs_set_property_ref(
            ctx, error, "operation",
            JS_NewString(ctx, operation != NULL ? operation : "unknown")) ||
        !esp32_mquickjs_set_property_ref(ctx, error, "details",
                                         *rooted_details)) {
        JS_PopGCRef(ctx, &error_ref);
        JS_PopGCRef(ctx, &details_ref);
        return JS_EXCEPTION;
    }
    JS_PopGCRef(ctx, &details_ref);
    return JS_Throw(ctx, JS_PopGCRef(ctx, &error_ref));
}

esp32_mquickjs_runtime_t *esp32_mquickjs_get_active_runtime(void)
{
    return s_active_runtime;
}

void esp32_mquickjs_set_system_hooks(esp32_mquickjs_runtime_t *runtime,
                                     esp32_mquickjs_host_status_fn status,
                                     esp32_mquickjs_system_control_fn control,
                                     void *opaque)
{
    if (runtime == NULL) {
        return;
    }
    runtime->host_status = status;
    runtime->system_control = control;
    runtime->system_opaque = opaque;
}

void esp32_mquickjs_set_safe_mode_hook(
    esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_safe_mode_control_fn control)
{
    if (runtime != NULL) {
        runtime->safe_mode_control = control;
    }
}

bool esp32_mquickjs_set_safe_mode(esp32_mquickjs_runtime_t *runtime,
                                  bool enabled)
{
    return runtime != NULL && runtime->safe_mode_control != NULL &&
           runtime->safe_mode_control(runtime->system_opaque, enabled);
}

bool esp32_mquickjs_get_host_status(esp32_mquickjs_runtime_t *runtime,
                                    esp32_mquickjs_host_status_t *status)
{
    if (runtime == NULL || status == NULL) {
        return false;
    }
    memset(status, 0, sizeof(*status));
    if (runtime->host_status != NULL) {
        return runtime->host_status(runtime->system_opaque, status);
    }
    status->state = ESP32_MQUICKJS_RUNTIME_RUNNING;
    status->generation = 1U;
    status->generation_started_us = runtime->context_started_us;
    status->littlefs_mounted = runtime->littlefs_mounted;
    snprintf(status->fs_root,
             sizeof(status->fs_root),
             "%s",
             ESP32_MQUICKJS_LITTLEFS_BASE_PATH);
    return true;
}

