99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs.c
bool esp32_mquickjs_request_system_control(
    esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_control_action_t action,
    const char *reason,
    uint32_t delay_ms,
    esp32_mquickjs_control_receipt_t *receipt,
    esp32_mquickjs_control_result_t *result)
{
    esp32_mquickjs_control_result_t control_result;

    if (result != NULL) {
        *result = ESP32_MQUICKJS_CONTROL_UNAVAILABLE;
    }
    if (runtime == NULL || reason == NULL || receipt == NULL ||
        runtime->system_control == NULL) {
        return false;
    }
    control_result = runtime->system_control(runtime->system_opaque,
                                             action,
                                             reason,
                                             delay_ms,
                                             receipt);
    if (result != NULL) {
        *result = control_result;
    }
    return control_result == ESP32_MQUICKJS_CONTROL_ACCEPTED;
}

bool esp32_mquickjs_get_resource_status(
    esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_resource_status_t *status)
{
    esp32_mquickjs_timer_state_t *timer_state;
    esp32_mquickjs_async_state_t *async_state;
    esp32_mquickjs_future_status_t future_status;
    esp32_mquickjs_event_queue_status_t event_status;
    int i;

    if (runtime == NULL || status == NULL) {
        return false;
    }
    memset(status, 0, sizeof(*status));
    status->timers_capacity = ESP32_MQUICKJS_MAX_TIMERS;
    status->async_pollers_capacity = ESP32_MQUICKJS_MAX_ASYNC_POLLERS;
    status->orphans_capacity = ESP32_MQUICKJS_REAPER_CAPACITY;
    timer_state = esp32_mquickjs_timer_state(runtime);
    if (timer_state != NULL && timer_state->slots != NULL) {
        for (i = 0; i < ESP32_MQUICKJS_MAX_TIMERS; ++i) {
            if (timer_state->slots[i].allocated) {
                status->timers_active++;
            }
        }
    }
    async_state = esp32_mquickjs_async_state(runtime);
    if (async_state != NULL) {
        status->async_pollers_registered = (uint32_t)async_state->poller_count;
        status->orphans_pending =
            (uint32_t)esp32_mquickjs_reaper_pending(&async_state->reapers);
    }
    if (!esp32_mquickjs_get_future_status(runtime, &future_status) ||
        !esp32_mquickjs_get_event_queue_status(runtime, &event_status)) {
        return false;
    }
    status->futures_queued = future_status.queued;
    status->futures_pending = future_status.pending;
    status->futures_capacity = future_status.capacity;
    status->futures_user_capacity = future_status.user_capacity;
    status->futures_internal_reserve = future_status.internal_reserve;
    status->event_queues_open = event_status.open;
    status->event_queues_dropped = event_status.dropped;
    return true;
}

static esp32_mquickjs_timer_state_t *esp32_mquickjs_timer_state(esp32_mquickjs_runtime_t *runtime)
{
    if (runtime == NULL) {
        return NULL;
    }
    return runtime->timer_state;
}

static bool esp32_mquickjs_init_timer_state(esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_timer_state_t *state;
    esp32_mquickjs_timer_slot_t *slots;
    int i;

    if (runtime == NULL) {
        return false;
    }
    if (runtime->timer_state != NULL) {
        return true;
    }

    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    slots = heap_caps_calloc(ESP32_MQUICKJS_MAX_TIMERS, sizeof(*slots), MALLOC_CAP_8BIT);
    if (state == NULL || slots == NULL) {
        heap_caps_free(state);
        heap_caps_free(slots);
        return false;
    }

    state->queue = xQueueCreate(ESP32_MQUICKJS_TIMER_QUEUE_LEN, sizeof(esp32_mquickjs_timer_event_t));
    if (state->queue == NULL) {
        heap_caps_free(slots);
        heap_caps_free(state);
        return false;
    }

    state->slots = slots;
    for (i = 0; i < ESP32_MQUICKJS_MAX_TIMERS; ++i) {
        slots[i].runtime = runtime;
        slots[i].timer_id = (uint8_t)i;
        atomic_init(&slots[i].delivery_lost, false);
    }

    runtime->timer_state = state;
    return true;
}

static void esp32_mquickjs_timer_cb(void *arg)
{
    esp32_mquickjs_timer_slot_t *slot = arg;
    esp32_mquickjs_timer_state_t *state;
    esp32_mquickjs_timer_event_t event;

    if (slot == NULL || !slot->allocated || slot->pending) {
        return;
    }

    state = esp32_mquickjs_timer_state(slot->runtime);
    if (state == NULL || state->queue == NULL) {
        return;
    }

    event.timer_id = slot->timer_id;
    event.generation = slot->generation;
    slot->pending = true;
    if (xQueueSend(state->queue, &event, 0) != pdTRUE) {
        atomic_store_explicit(&slot->delivery_lost, true, memory_order_release);
    }
    esp32_mquickjs_notify_activity(slot->runtime);
}

static JSValue js_value_to_delay_ms(JSContext *ctx,
                                     int argc,
                                     JSValue *argv,
                                     int arg_index,
                                     bool repeating)
{
    int delay_ms = 0;

    if (argc > arg_index && JS_ToInt32(ctx, &delay_ms, argv[arg_index]) != 0) {
        return JS_EXCEPTION;
    }
    if (delay_ms < 0) {
        return JS_ThrowRangeError(ctx, "timer delay must be non-negative");
    }
    if (repeating && delay_ms < CONFIG_ESP32_MQUICKJS_MIN_INTERVAL_MS) {
        delay_ms = CONFIG_ESP32_MQUICKJS_MIN_INTERVAL_MS;
    } else if (delay_ms == 0) {
        delay_ms = 1;
    }
    return JS_NewInt32(ctx, delay_ms);
}

static uint64_t esp32_mquickjs_timer_handle(const esp32_mquickjs_timer_slot_t *slot)
{
    return ((uint64_t)slot->generation << ESP32_MQUICKJS_TIMER_HANDLE_ID_BITS) |
           (uint64_t)slot->timer_id;
}

static bool esp32_mquickjs_decode_timer_handle(JSContext *ctx,
                                                JSValue value,
                                                uint8_t *out_timer_id,
                                                uint32_t *out_generation)
{
    double raw_handle;
    uint64_t handle;

    if (JS_ToNumber(ctx, &raw_handle, value) != 0 ||
        !(raw_handle > 0) ||
        raw_handle > (double)ESP32_MQUICKJS_TIMER_HANDLE_MAX) {
        return false;
    }
    handle = (uint64_t)raw_handle;
    if ((double)handle != raw_handle) {
        return false;
    }
    *out_timer_id = (uint8_t)(handle & ESP32_MQUICKJS_TIMER_HANDLE_ID_MASK);
    *out_generation = (uint32_t)(handle >> ESP32_MQUICKJS_TIMER_HANDLE_ID_BITS);
    return *out_generation != 0 &&
           *out_timer_id < ESP32_MQUICKJS_MAX_TIMERS &&
           handle == (((uint64_t)*out_generation << ESP32_MQUICKJS_TIMER_HANDLE_ID_BITS) |
                      (uint64_t)*out_timer_id);
}

static void esp32_mquickjs_cancel_timer(JSContext *ctx, esp32_mquickjs_timer_slot_t *slot)
{
    if (slot == NULL || !slot->allocated) {
        return;
    }

