99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs.c
    if (slot->handle != NULL) {
        esp_timer_stop(slot->handle);
        esp_timer_delete(slot->handle);
        slot->handle = NULL;
    }

    JS_DeleteGCRef(ctx, &slot->callback);
    slot->allocated = false;
    slot->repeating = false;
    slot->pending = false;
    atomic_store_explicit(&slot->delivery_lost, false, memory_order_release);
}

static void esp32_mquickjs_deinit_timer_state(JSContext *ctx,
                                               esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_timer_state_t *state = esp32_mquickjs_timer_state(runtime);
    int i;

    if (state == NULL) {
        return;
    }
    if (state->slots != NULL) {
        for (i = 0; i < ESP32_MQUICKJS_MAX_TIMERS; ++i) {
            esp32_mquickjs_timer_slot_t *slot = &state->slots[i];

            if (slot->allocated && ctx != NULL) {
                esp32_mquickjs_cancel_timer(ctx, slot);
            } else if (slot->handle != NULL) {
                esp_timer_stop(slot->handle);
                esp_timer_delete(slot->handle);
                slot->handle = NULL;
            }
        }
    }
    if (state->queue != NULL) {
        vQueueDelete(state->queue);
    }
    heap_caps_free(state->slots);
    heap_caps_free(state);
    runtime->timer_state = NULL;
}

static void esp32_mquickjs_deinit_async_state(esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(runtime);

    if (state == NULL) {
        return;
    }
    heap_caps_free(state->pollers);
    heap_caps_free(state);
    runtime->async_state = NULL;
}

static JSValue esp32_mquickjs_create_timer(JSContext *ctx,
                                           esp32_mquickjs_runtime_t *runtime,
                                           JSValue *callback,
                                           JSValue delay_value,
                                           bool repeating)
{
    esp32_mquickjs_timer_state_t *state = esp32_mquickjs_timer_state(runtime);
    esp32_mquickjs_timer_slot_t *slot = NULL;
    esp_timer_create_args_t timer_args = {0};
    JSValue delay_js;
    JSValue *pfunc;
    int delay_ms = 0;
    int i;

    if (!JS_IsFunction(ctx, *callback)) {
        return JS_ThrowTypeError(ctx, "timer callback must be a function");
    }
    if (state == NULL || state->slots == NULL) {
        return JS_ThrowInternalError(ctx, "timer state is not initialized");
    }

    delay_js = js_value_to_delay_ms(ctx, 1, &delay_value, 0, repeating);
    if (JS_IsException(delay_js)) {
        return delay_js;
    }
    if (JS_ToInt32(ctx, &delay_ms, delay_js) != 0) {
        return JS_EXCEPTION;
    }

    for (i = 0; i < ESP32_MQUICKJS_MAX_TIMERS; ++i) {
        if (!state->slots[i].allocated) {
            slot = &state->slots[i];
            break;
        }
    }
    if (slot == NULL) {
        return JS_ThrowInternalError(ctx, "too many timers");
    }

    slot->generation++;
    if (slot->generation == 0) {
        slot->generation++;
    }
    slot->pending = false;
    atomic_store_explicit(&slot->delivery_lost, false, memory_order_release);
    slot->repeating = repeating;
    slot->allocated = true;
    pfunc = JS_AddGCRef(ctx, &slot->callback);
    *pfunc = *callback;

    timer_args.callback = esp32_mquickjs_timer_cb;
    timer_args.arg = slot;
    timer_args.dispatch_method = ESP_TIMER_TASK;
    timer_args.name = repeating ? "mqjs_interval" : "mqjs_timeout";
    timer_args.skip_unhandled_events = true;

    if (esp_timer_create(&timer_args, &slot->handle) != ESP_OK) {
        JS_DeleteGCRef(ctx, &slot->callback);
        slot->allocated = false;
        slot->repeating = false;
        return JS_ThrowInternalError(ctx, "esp_timer_create() failed");
    }

    if ((repeating ? esp_timer_start_periodic(slot->handle, (uint64_t)delay_ms * 1000ULL)
                   : esp_timer_start_once(slot->handle, (uint64_t)delay_ms * 1000ULL)) != ESP_OK) {
        esp_timer_delete(slot->handle);
        slot->handle = NULL;
        JS_DeleteGCRef(ctx, &slot->callback);
        slot->allocated = false;
        slot->repeating = false;
        return JS_ThrowInternalError(ctx, "failed to start timer");
    }

    return JS_NewInt64(ctx, (int64_t)esp32_mquickjs_timer_handle(slot));
}

JSContext *esp32_mquickjs_create(void *mem_start,
                                 size_t mem_size,
                                 esp32_mquickjs_runtime_t *runtime,
                                 uint32_t eval_timeout_ms)
{
    JSContext *ctx;
#if CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS
    bool initialized_runtime_logs = false;
#endif

    if (runtime == NULL || s_active_runtime != NULL) {
        return NULL;
    }

    esp32_mquickjs_peripheral_leases_reset();

    runtime->deadline_us = 0;
    runtime->eval_timeout_ms = eval_timeout_ms;
    runtime->async_generation = 0;
    runtime->output_generation = 0;
    runtime->littlefs_mounted = false;
    runtime->scoped_deadline_us = 0;
    runtime->native_wait_depth = 0;
    runtime->load_root_depth = 0;
    snprintf(runtime->startup_fs_root,
             sizeof(runtime->startup_fs_root),
             "%s",
             ESP32_MQUICKJS_LITTLEFS_BASE_PATH);
    runtime->load_root[0] = '\0';
    runtime->repl_enabled = false;
    runtime->auto_run_startup_script = false;
    runtime->format_littlefs_on_mount_fail = false;
#ifdef CONFIG_ESP32QJS_ENABLE_REPL
    runtime->repl_enabled = true;
#endif
#ifdef CONFIG_ESP32QJS_AUTORUN_INDEX_JS
    runtime->auto_run_startup_script = true;
#endif
#ifdef CONFIG_ESP32QJS_LITTLEFS_FORMAT_ON_MOUNT_FAIL
    runtime->format_littlefs_on_mount_fail = true;
#endif
    runtime->prepare_output = NULL;
    runtime->prepare_output_opaque = NULL;
    runtime->cooperate = NULL;
    runtime->cooperate_opaque = NULL;
    runtime->timer_state = NULL;
    runtime->async_state = NULL;
    runtime->future_state = NULL;
    runtime->event_queue_state = NULL;
    runtime->fs_state = NULL;
    runtime->startup_bytecode = NULL;
    runtime->context_started_us = (uint64_t)esp_timer_get_time();
    esp32_mquickjs_ensure_boot_id(runtime);
#if CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS
    if (runtime->runtime_log_state == NULL) {
        if (!esp32_mquickjs_init_runtime_logs(runtime)) {
            return NULL;
        }
        initialized_runtime_logs = true;
    }
#else
    runtime->runtime_log_state = NULL;
#endif
    if (!esp32_mquickjs_init_async_state(runtime)) {
#if CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS
        if (initialized_runtime_logs) {
            esp32_mquickjs_deinit_runtime_logs(runtime);
        }
#endif
        return NULL;
    }
    if (!esp32_mquickjs_init_timer_state(runtime)) {
        esp32_mquickjs_deinit_async_state(runtime);
#if CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS
        if (initialized_runtime_logs) {
            esp32_mquickjs_deinit_runtime_logs(runtime);
        }
#endif
        return NULL;
    }

    ctx = JS_NewContext(mem_start, mem_size, &js_stdlib);
    if (ctx == NULL) {
        esp32_mquickjs_deinit_timer_state(NULL, runtime);
        esp32_mquickjs_deinit_async_state(runtime);
#if CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS
        if (initialized_runtime_logs) {
            esp32_mquickjs_deinit_runtime_logs(runtime);
        }
#endif
        return NULL;
    }

