99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs.c
    JS_SetContextOpaque(ctx, runtime);
    JS_SetLogFunc(ctx, js_log_write);
    JS_SetInterruptHandler(ctx, js_interrupt_handler);
    JS_SetRandomSeed(ctx, (uint64_t)esp_timer_get_time());
    s_active_runtime = runtime;
    if (!esp32_mquickjs_init_future_runtime(ctx, runtime)) {
        s_active_runtime = NULL;
        JS_FreeContext(ctx);
        esp32_mquickjs_deinit_timer_state(NULL, runtime);
        esp32_mquickjs_deinit_async_state(runtime);
#if CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS
        if (initialized_runtime_logs) {
            esp32_mquickjs_deinit_runtime_logs(runtime);
        }
#endif
        return NULL;
    }
    if (!esp32_mquickjs_init_event_queue_runtime(ctx, runtime)) {
        esp32_mquickjs_deinit_future_runtime(runtime);
        s_active_runtime = NULL;
        JS_FreeContext(ctx);
        esp32_mquickjs_deinit_timer_state(NULL, runtime);
        esp32_mquickjs_deinit_async_state(runtime);
#if CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS
        if (initialized_runtime_logs) {
            esp32_mquickjs_deinit_runtime_logs(runtime);
        }
#endif
        return NULL;
    }
    return ctx;
}

static bool esp32_mquickjs_destroy_internal(JSContext *ctx,
                                            esp32_mquickjs_runtime_t *runtime,
                                            bool preserve_persistent_state)
{
    if (runtime == NULL) {
        return false;
    }
    if (!esp32_mquickjs_prepare_future_runtime_destroy(ctx, runtime)) {
        return false;
    }
    (void)esp32_mquickjs_poll_reapers(runtime);
    if (esp32_mquickjs_reapers_pending(runtime) > 0) {
        return false;
    }
    esp32_mquickjs_clear_idle_jobs(ctx, runtime);

#if CONFIG_ESP32_MQUICKJS_FEATURE_SOCKET
    esp32_mquickjs_deinit_socket_runtime(ctx);
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WEBSOCKET
    if (!esp32_mquickjs_deinit_websocket_runtime(ctx)) {
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_HTTP
    if (!esp32_mquickjs_deinit_http_runtime(ctx)) {
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_USB_SERIAL
    esp32_mquickjs_deinit_usb_serial_runtime(ctx);
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_RPC
    esp32_mquickjs_deinit_rpc_runtime();
#endif
    if (s_active_runtime == runtime) {
        s_active_runtime = NULL;
    }
#if CONFIG_ESP32_MQUICKJS_FEATURE_HTTP_SERVER
    esp32_mquickjs_deinit_http_server_runtime(ctx);
#endif
    esp32_mquickjs_deinit_time_runtime();
#if CONFIG_ESP32_MQUICKJS_FEATURE_BLE
    if (!esp32_mquickjs_deinit_ble_runtime(ctx)) {
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI_CSI
    esp32_mquickjs_deinit_wifi_csi_runtime(ctx);
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_ESPNOW
    esp32_mquickjs_deinit_espnow_runtime(ctx);
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    esp32_mquickjs_deinit_wifi_runtime(ctx);
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_NET
    esp32_mquickjs_deinit_net_runtime(runtime);
#endif
    esp32_mquickjs_deinit_stream_runtime();
#if CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP
    esp32_mquickjs_deinit_bitmap_runtime(ctx);
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_CAMERA
    esp32_mquickjs_deinit_camera_runtime(ctx);
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_I2S
    esp32_mquickjs_deinit_i2s_runtime();
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_RMT
    esp32_mquickjs_deinit_rmt_runtime();
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_GPIO
    esp32_mquickjs_deinit_gpio_runtime(ctx);
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_ADC
    esp32_mquickjs_deinit_adc_runtime();
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_DAC
    esp32_mquickjs_deinit_dac_runtime();
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_LEDC
    esp32_mquickjs_deinit_ledc_runtime();
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_I2C
    if (!esp32_mquickjs_deinit_i2c_runtime()) {
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_SPI
    if (!esp32_mquickjs_deinit_spi_runtime()) {
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_UART
    esp32_mquickjs_deinit_uart_runtime();
#endif

    esp32_mquickjs_deinit_timer_state(ctx, runtime);
    if (ctx != NULL) {
        JS_FreeContext(ctx);
        esp32_mquickjs_memory_release_generation();
    }
    esp32_mquickjs_deinit_event_queue_runtime(runtime);
#if CONFIG_ESP32_MQUICKJS_FEATURE_FS
    esp32_mquickjs_deinit_fs_runtime(runtime);
#endif
    esp32_mquickjs_memory_payload_free(runtime->startup_bytecode);
    runtime->startup_bytecode = NULL;
    esp32_mquickjs_deinit_future_runtime(runtime);
    esp32_mquickjs_deinit_async_state(runtime);
#if CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS
    if (!preserve_persistent_state) {
        esp32_mquickjs_deinit_runtime_logs(runtime);
    }
#endif
    runtime->deadline_us = 0;
    runtime->scoped_deadline_us = 0;
    runtime->native_wait_depth = 0;
    runtime->littlefs_mounted = false;
    runtime->load_root_depth = 0;
    runtime->startup_fs_root[0] = '\0';
    runtime->load_root[0] = '\0';
    runtime->repl_enabled = false;
    runtime->auto_run_startup_script = false;
    runtime->format_littlefs_on_mount_fail = false;
    runtime->prepare_output = NULL;
    runtime->prepare_output_opaque = NULL;
    runtime->cooperate = NULL;
    runtime->cooperate_opaque = NULL;
    runtime->context_started_us = 0;
    return true;
}

bool esp32_mquickjs_destroy(JSContext *ctx,
                            esp32_mquickjs_runtime_t *runtime)
{
    bool destroyed = esp32_mquickjs_destroy_internal(ctx, runtime, false);

    if (destroyed && runtime != NULL) {
        runtime->host_status = NULL;
        runtime->system_control = NULL;
        runtime->safe_mode_control = NULL;
        runtime->system_opaque = NULL;
    }
    return destroyed;
}

bool esp32_mquickjs_destroy_generation(JSContext *ctx,
                                       esp32_mquickjs_runtime_t *runtime)
{
    return esp32_mquickjs_destroy_internal(ctx, runtime, true);
}

void esp32_mquickjs_release_persistent_state(esp32_mquickjs_runtime_t *runtime)
{
    if (runtime == NULL) {
        return;
    }
#if CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS
    esp32_mquickjs_deinit_runtime_logs(runtime);
#endif
    runtime->host_status = NULL;
    runtime->system_control = NULL;
    runtime->safe_mode_control = NULL;
    runtime->system_opaque = NULL;
}

void esp32_mquickjs_set_eval_timeout(esp32_mquickjs_runtime_t *runtime,
                                     uint32_t eval_timeout_ms)
{
    if (runtime == NULL) {
        return;
    }
    runtime->eval_timeout_ms = eval_timeout_ms;
}

