99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs.c
JSValue esp32_mquickjs_eval(JSContext *ctx,
                            esp32_mquickjs_runtime_t *runtime,
                            const char *source,
                            const char *filename,
                            int eval_flags)
{
    uint64_t previous_deadline = runtime != NULL ? runtime->deadline_us : 0;
    JSValue result;

    if (runtime != NULL && runtime->eval_timeout_ms > 0) {
        uint64_t eval_deadline = esp_timer_get_time() +
                                 ((uint64_t)runtime->eval_timeout_ms * 1000ULL);

        if (previous_deadline == 0 || eval_deadline < previous_deadline) {
            runtime->deadline_us = eval_deadline;
        }
    }

    esp32_mquickjs_execution_enter(runtime);
    result = JS_Eval(ctx, source, strlen(source), filename, eval_flags);
    result = esp32_mquickjs_finish_execution(runtime, result);

    if (runtime != NULL) {
        runtime->deadline_us = previous_deadline;
    }
    return result;
}

JSValue esp32_mquickjs_run(JSContext *ctx,
                           esp32_mquickjs_runtime_t *runtime,
                           JSValue compiled_code)
{
    uint64_t previous_deadline = runtime != NULL ? runtime->deadline_us : 0;
    JSValue result;

    if (runtime != NULL && runtime->eval_timeout_ms > 0) {
        uint64_t eval_deadline = esp_timer_get_time() +
                                 ((uint64_t)runtime->eval_timeout_ms * 1000ULL);

        if (previous_deadline == 0 || eval_deadline < previous_deadline) {
            runtime->deadline_us = eval_deadline;
        }
    }

    esp32_mquickjs_execution_enter(runtime);
    result = JS_Run(ctx, compiled_code);
    result = esp32_mquickjs_finish_execution(runtime, result);

    if (runtime != NULL) {
        runtime->deadline_us = previous_deadline;
    }
    return result;
}

void esp32_mquickjs_print_exception(JSContext *ctx)
{
    JSValue exception = JS_GetException(ctx);
    esp32_mquickjs_runtime_t *runtime = JS_GetContextOpaque(ctx);

    console_output_begin(runtime, ESP32_MQUICKJS_LOG_SOURCE_EXCEPTION);
    JS_PrintValueF(ctx, exception, JS_DUMP_LONG);
    console_output_end(runtime);
}

JSValue js_help(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)ctx;
    (void)this_val;
    (void)argc;
    (void)argv;
    console_output_begin(esp32_mquickjs_get_active_runtime(),
                         ESP32_MQUICKJS_LOG_SOURCE_RUNTIME);
    console_output_write(esp32_mquickjs_get_active_runtime(),
                         "See docs/api/README.md for the API reference.",
                         strlen("See docs/api/README.md for the API reference."));
    console_output_end(esp32_mquickjs_get_active_runtime());
    return JS_UNDEFINED;
}

bool esp32_mquickjs_install_globals(JSContext *ctx,
                                    esp32_mquickjs_runtime_t *runtime)
{
    if (ctx == NULL || runtime == NULL) {
        return false;
    }

    esp32_mquickjs_memory_init();
    if (!esp32_mquickjs_init_secure_random(ctx)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
    if (!esp32_mquickjs_init_stream_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#if CONFIG_ESP32_MQUICKJS_FEATURE_NVS
    if (!esp32_mquickjs_init_nvs_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_FS
    if (!esp32_mquickjs_init_fs_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP
    if (!esp32_mquickjs_init_bitmap_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_LEDC
    if (!esp32_mquickjs_init_ledc_runtime(ctx)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_ADC
    if (!esp32_mquickjs_init_adc_runtime(ctx)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_DAC
    esp32_mquickjs_init_dac_runtime();
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_I2C
    if (!esp32_mquickjs_init_i2c_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_SPI
    if (!esp32_mquickjs_init_spi_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_UART
    if (!esp32_mquickjs_init_uart_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_I2S
    if (!esp32_mquickjs_init_i2s_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_RMT
    if (!esp32_mquickjs_init_rmt_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_CAMERA
    if (!esp32_mquickjs_init_camera_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_USB_SERIAL
    if (!esp32_mquickjs_init_usb_serial_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_NET
    if (!esp32_mquickjs_init_net_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
    if (!esp32_mquickjs_init_time_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#if CONFIG_ESP32_MQUICKJS_FEATURE_BLE
    if (!esp32_mquickjs_init_ble_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    if (!esp32_mquickjs_init_wifi_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI_CSI
    if (!esp32_mquickjs_init_wifi_csi_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_ESPNOW
    if (!esp32_mquickjs_init_espnow_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_SOCKET
    if (!esp32_mquickjs_init_socket_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WEBSOCKET
    if (!esp32_mquickjs_init_websocket_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_HTTP
    if (!esp32_mquickjs_init_http_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_HTTP_SERVER
    if (!esp32_mquickjs_init_http_server_runtime(ctx, runtime)) {
        esp32_mquickjs_print_exception(ctx);
        return false;
    }
#endif
    return true;
}

static bool esp32_mquickjs_dispatch_timer_event(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_timer_event_t event)
{
    esp32_mquickjs_timer_state_t *state = esp32_mquickjs_timer_state(runtime);
    esp32_mquickjs_timer_slot_t *slot;
    JSGCRef callback_ref;
    JSValue *callback;
    JSValue ret;

    if (ctx == NULL || state == NULL || state->slots == NULL ||
        event.timer_id >= ESP32_MQUICKJS_MAX_TIMERS) {
        return false;
    }
    slot = &state->slots[event.timer_id];
    if (!slot->allocated || !slot->pending ||
        slot->generation != event.generation) {
        return false;
    }

    if (JS_StackCheck(ctx, 2)) {
        console_output_begin(runtime, ESP32_MQUICKJS_LOG_SOURCE_RUNTIME);
        console_output_write(runtime,
                             "Timer callback skipped: JS stack overflow",
                             strlen("Timer callback skipped: JS stack overflow"));
        console_output_end(runtime);
        esp32_mquickjs_cancel_timer(ctx, slot);
        return true;
    }

    callback = JS_PushGCRef(ctx, &callback_ref);
    *callback = slot->callback.val;
    if (!slot->repeating) {
        esp32_mquickjs_cancel_timer(ctx, slot);
    }

    ret = esp32_mquickjs_call(ctx, runtime, *callback, JS_NULL, 0, NULL);
    if (slot->allocated && slot->generation == event.generation &&
        slot->repeating) {
        /*
         * Keep a repeating timer pending for the entire callback. Native
         * Future waits can poll the scheduler recursively; clearing this flag
         * before the call lets the same periodic timer enter itself again.
         */
        slot->pending = false;
    }
    if (JS_IsException(ret)) {
        esp32_mquickjs_print_exception(ctx);
        if (slot->allocated && slot->generation == event.generation &&
            slot->repeating) {
            esp32_mquickjs_cancel_timer(ctx, slot);
        }
    }
    JS_PopGCRef(ctx, &callback_ref);
    return true;
}

esp32_mquickjs_poll_result_t esp32_mquickjs_poll(JSContext *ctx,
                                                 esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_timer_state_t *state = esp32_mquickjs_timer_state(runtime);
    esp32_mquickjs_timer_event_t event;
    esp32_mquickjs_timer_event_t lost_timers[ESP32_MQUICKJS_MAX_TIMERS];
    UBaseType_t timer_budget;
    size_t lost_timer_count = 0;
    size_t i;
    bool core_async_handled = false;
    bool async_handled = false;
    uint32_t output_generation;
    esp32_mquickjs_poll_result_t result = ESP32_MQUICKJS_POLL_NONE;

    if (ctx == NULL || runtime == NULL) {
        return ESP32_MQUICKJS_POLL_NONE;
    }
    output_generation = runtime->output_generation;
    if (esp32_mquickjs_future_poll(ctx, runtime)) {
        core_async_handled = true;
    }
    if (state == NULL || state->queue == NULL || state->slots == NULL) {
        async_handled = esp32_mquickjs_poll_registered(ctx, runtime);
        core_async_handled = esp32_mquickjs_poll_reapers(runtime) ||
                             core_async_handled;
        core_async_handled = esp32_mquickjs_poll_idle_job(ctx, runtime) ||
                             core_async_handled;
        if (core_async_handled || async_handled) {
            runtime->async_generation++;
            result |= ESP32_MQUICKJS_POLL_ASYNC;
        }
        if (runtime->output_generation != output_generation) {
            result |= ESP32_MQUICKJS_POLL_OUTPUT;
        }
        if (!esp32_mquickjs_execution_active(runtime)) {
            esp32_mquickjs_memory_maintain();
        }
        return result;
    }

