99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs.c
    /*
     * Snapshot both queued events and queue-overflow recovery before invoking
     * callbacks. Events raised by a callback remain pending for the next turn,
     * so an overdue interval cannot starve pollers or idle work.
     */
    for (i = 0; i < ESP32_MQUICKJS_MAX_TIMERS; ++i) {
        esp32_mquickjs_timer_slot_t *slot = &state->slots[i];

        if (!atomic_exchange_explicit(&slot->delivery_lost, false,
                                      memory_order_acq_rel)) {
            continue;
        }
        if (!slot->allocated || !slot->pending) {
            continue;
        }
        lost_timers[lost_timer_count].timer_id = slot->timer_id;
        lost_timers[lost_timer_count].generation = slot->generation;
        lost_timer_count++;
    }
    timer_budget = uxQueueMessagesWaiting(state->queue);
    while (timer_budget > 0 &&
           xQueueReceive(state->queue, &event, 0) == pdTRUE) {
        timer_budget--;
        core_async_handled =
            esp32_mquickjs_dispatch_timer_event(ctx, runtime, event) ||
            core_async_handled;
    }
    for (i = 0; i < lost_timer_count; ++i) {
        core_async_handled = esp32_mquickjs_dispatch_timer_event(
                                 ctx, runtime, lost_timers[i]) ||
                             core_async_handled;
    }

    async_handled = esp32_mquickjs_poll_registered(ctx, runtime);
    core_async_handled = esp32_mquickjs_poll_reapers(runtime) ||
                         core_async_handled;
    core_async_handled = esp32_mquickjs_poll_idle_job(ctx, runtime) ||
                         core_async_handled;
    if (core_async_handled || async_handled) {
        runtime->async_generation++;
        result |= ESP32_MQUICKJS_POLL_ASYNC;
    }
    if (runtime->output_generation != output_generation) {
        result |= ESP32_MQUICKJS_POLL_OUTPUT;
    }
    if (!esp32_mquickjs_execution_active(runtime)) {
        esp32_mquickjs_memory_maintain();
    }
    return result;
}

JSValue js_print(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    int i;
    esp32_mquickjs_runtime_t *runtime = JS_GetContextOpaque(ctx);

    (void)this_val;
    console_output_begin(runtime, ESP32_MQUICKJS_LOG_SOURCE_JAVASCRIPT);
    for (i = 0; i < argc; i++) {
        if (i != 0) {
            console_output_write(runtime, " ", 1U);
        }

        if (JS_IsString(ctx, argv[i])) {
            JSCStringBuf buf;
            size_t len = 0;
            const char *str = JS_ToCStringLen(ctx, &len, argv[i], &buf);

            console_output_write(runtime, str, len);
        } else {
            JS_PrintValueF(ctx, argv[i], JS_DUMP_LONG);
        }
    }

    console_output_end(runtime);
    return JS_UNDEFINED;
}

JSValue js_gc(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    JS_GC(ctx);
    return JS_UNDEFINED;
}

JSValue js_load(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
#if !CONFIG_ESP32_MQUICKJS_FEATURE_FS
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowInternalError(ctx, "load() requires the fs feature");
#else
    JSCStringBuf command_buf;
    char command[ESP32_MQUICKJS_MAX_SCRIPT_PATH];
    const char *source;
    size_t command_len;

    (void)this_val;
    if (argc < 1 || !JS_IsString(ctx, argv[0])) {
        return JS_ThrowTypeError(ctx, "load(path) expects a script path");
    }

    source = JS_ToCStringLen(ctx, &command_len, argv[0], &command_buf);
    if (source == NULL) {
        return JS_EXCEPTION;
    }
    if (command_len >= sizeof(command)) {
        return JS_ThrowTypeError(ctx, "load(path) path is too long");
    }

    /* JS_ToCStringLen may point into the moving MQuickJS heap.  The active
       filesystem lookup allocates JS values, so preserve the path in native
       storage before it can trigger a compacting collection. */
    memcpy(command, source, command_len);
    command[command_len] = '\0';

    return esp32_mquickjs_load_from_active_fs(ctx, s_active_runtime, command);
#endif
}

JSValue js_sleep(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    int delay_ms;

    (void)this_val;
    if (argc < 1 || JS_ToInt32(ctx, &delay_ms, argv[0]) != 0 || delay_ms < 0) {
        return JS_ThrowTypeError(ctx, "sleep(ms) expects a non-negative integer");
    }
    if (!esp32_mquickjs_cooperative_delay(s_active_runtime, (uint32_t)delay_ms)) {
        return JS_ThrowInternalError(ctx, "sleep(ms) was interrupted by a runtime stop request");
    }
    return JS_NewInt32(ctx, delay_ms);
}

JSValue js_runtime_defer_idle(JSContext *ctx, JSValue *this_val,
                              int argc, JSValue *argv)
{
    esp32_mquickjs_async_state_t *state = esp32_mquickjs_async_state(s_active_runtime);
    esp32_mquickjs_idle_job_t *job;
    JSValue *callback;

    (void)this_val;
    if (argc != 1 || !JS_IsFunction(ctx, argv[0])) {
        return JS_ThrowTypeError(ctx, "sys._deferIdle(callback) expects one function");
    }
    if (state == NULL) {
        return JS_ThrowInternalError(ctx, "runtime idle queue is unavailable");
    }
    if (state->idle_count >= ESP32_MQUICKJS_IDLE_JOB_CAPACITY) {
        return JS_ThrowInternalError(ctx, "runtime idle queue is full");
    }

    job = &state->idle_jobs[state->idle_tail];
    if (job->allocated) {
        return JS_ThrowInternalError(ctx, "runtime idle queue is inconsistent");
    }
    callback = JS_AddGCRef(ctx, &job->callback);
    *callback = argv[0];
    job->allocated = true;
    state->idle_tail = (uint8_t)(
        (state->idle_tail + 1U) % ESP32_MQUICKJS_IDLE_JOB_CAPACITY);
    state->idle_count++;
    esp32_mquickjs_notify_activity(s_active_runtime);
    return JS_UNDEFINED;
}

JSValue js_setTimeout(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc < 1) {
        return JS_ThrowTypeError(ctx, "setTimeout(fn, ms) expects a function");
    }
    return esp32_mquickjs_create_timer(ctx,
                                       s_active_runtime,
                                       &argv[0],
                                       argc >= 2 ? argv[1] : JS_NewInt32(ctx, 0),
                                       false);
}

