99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs.c
JSValue js_setInterval(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc < 1) {
        return JS_ThrowTypeError(ctx, "setInterval(fn, ms) expects a function");
    }
    return esp32_mquickjs_create_timer(ctx,
                                       s_active_runtime,
                                       &argv[0],
                                       argc >= 2 ? argv[1] : JS_NewInt32(ctx, 0),
                                       true);
}

JSValue js_clearTimeout(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_timer_state_t *state = esp32_mquickjs_timer_state(s_active_runtime);
    uint8_t timer_id;
    uint32_t generation;

    (void)this_val;
    if (argc < 1 || !esp32_mquickjs_decode_timer_handle(ctx, argv[0], &timer_id, &generation)) {
        return JS_ThrowTypeError(ctx, "clearTimeout(handle) expects a timer handle");
    }
    if (state != NULL && state->slots != NULL) {
        esp32_mquickjs_timer_slot_t *slot = &state->slots[timer_id];

        if (slot->allocated && slot->generation == generation) {
            esp32_mquickjs_cancel_timer(ctx, slot);
        }
    }
    return JS_UNDEFINED;
}

JSValue js_date_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    double value;

    (void)this_val;
    argc &= ~FRAME_CF_CTOR;
    if (argc == 0) {
        struct timeval now = {0};

        gettimeofday(&now, NULL);
        value = (double)now.tv_sec * 1000.0 + (double)now.tv_usec / 1000.0;
    } else if (argc == 1 && JS_IsNumber(ctx, argv[0])) {
        if (JS_ToNumber(ctx, &value, argv[0]) != 0) {
            return JS_EXCEPTION;
        }
    } else {
        return JS_ThrowTypeError(ctx, "unsupported Date() parameter");
    }
    return JS_NewDate(ctx, value);
}

JSValue js_date_now(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    struct timeval now = {0};

    (void)this_val;
    (void)argc;
    (void)argv;
    gettimeofday(&now, NULL);
    return JS_NewInt64(ctx,
                       (int64_t)now.tv_sec * 1000LL +
                           (int64_t)now.tv_usec / 1000LL);
}

JSValue js_performance_now(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt64(ctx, esp_timer_get_time() / 1000);
}
